{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "auto_map": {
    "AutoConfig": "transformers.BertConfig",
    "AutoModelForSequenceClassification": "transformers.BertForSequenceClassification",
    "AutoTokenizer": "transformers.BertTokenizer"
  },
  "classifier_dropout": null,
  "finetuning_task": "text-classification",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ham",
    "1": "spam"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ham": 0,
    "spam": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pipeline_tag": "text-classification",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "task_specific_params": {
    "text-classification": {
      "num_labels": 2,
      "problem_type": "single_label_classification"
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32000
}
